In [1]:
import pandas as pd

In [2]:
data = [['1', '1', 'N'], ['2', '1', 'Y'], ['2', '2', 'N'], ['3', '3', 'N'], ['4', '2', 'N'], ['4', '3', 'Y'], ['4', '4', 'N']]
employee = pd.DataFrame(data, columns=['employee_id', 'department_id', 'primary_flag']).astype({'employee_id':'Int64', 'department_id':'Int64', 'primary_flag':'object'})

In [3]:
employee

   employee_id  department_id primary_flag
0            1              1            N
1            2              1            Y
2            2              2            N
3            3              3            N
4            4              2            N
5            4              3            Y
6            4              4            N

Employees can belong to multiple departments. When the employee joins other departments, they need to decide which department is their primary department. Note that when an employee belongs to only one department, their primary column is 'N'.

Write a solution to report all the employees with their primary department. For employees who belong to one department, report their only department.

Return the result table in any order.

The result format is in the following example.

| employee_id | department_id |
|-------------|---------------|
| 1           | 1             |
| 2           | 1             |
| 3           | 3             |
| 4           | 3             |

In [6]:
multi=employee.loc[employee["primary_flag"] == "Y"]
multi

   employee_id  department_id primary_flag
1            2              1            Y
5            4              3            Y

In [14]:
single=employee.groupby("employee_id").filter(lambda x: x["department_id"].count()==1)
single

   employee_id  department_id primary_flag
0            1              1            N
3            3              3            N

In [18]:
pd.concat([single,multi]).drop(labels=["primary_flag"],axis=1)

   employee_id  department_id
0            1              1
3            3              3
1            2              1
5            4              3

# No union all

In [19]:
employee[(employee['primary_flag']=='Y')]

   employee_id  department_id primary_flag
1            2              1            Y
5            4              3            Y

In [20]:
employee[(~employee.duplicated(subset='employee_id',keep=False))]

   employee_id  department_id primary_flag
0            1              1            N
3            3              3            N

In [23]:
employee[(employee['primary_flag']=='Y') | (~employee.duplicated(subset='employee_id',keep=False))].drop(labels=["primary_flag"],axis=1)

   employee_id  department_id
0            1              1
1            2              1
3            3              3
5            4              3